# в наличии список множеств. внутри множества целые числа
m = [{11, 3, 5}, {2, 17, 87, 32}, {4, 44}, {24, 11, 9, 7, 8}]
# Задание: посчитать
# 1 общее количество чисел
# 2 общую сумму чисел
# 3 посчитать среднее значение
# 4 собрать все множества в один кортеж
# *написать решения в одну строку


# 1 общее количество чисел
m_count = sum(map(len, m))

# 2 общая сумма чисел
m_sum = sum(map(sum, m))

# 3.1 среднее арифметическое всех чисел
m_avg = m_sum / m_count

# 3.2 среднее арифметическое средних арифметических по множествам
m_avg_by_sets = sum(map(lambda x: sum(x) / len(x), m)) / len(m)

# 4 собрать все множества в один кортеж (последовательность изменится из-за неупорядоченности множеств)
m_tpl = tuple(x for s in m for x in s)
